<?php
//$allData = [
//	'id' => [],
//	'gender' => [
//		'male' => ['Александр', 'Фёдор', 'Савелий', 'Максим', 'Виктор', 'Кирилл'],
//		'female' => ['Мария', 'Анна', 'Александра', 'Юлия'],
//	],
//	'lastName' => [
//		'Иванов',
//		'Дегтярев',
//		'Жиленков',
//		'Тимофеев',
//		'Турин',
//		'Комаров',
//		'Панищев',
//	],
//	'domains' => ['gmail.com', 'yandex.ru', 'mail.ru'],
//	'position_id' => [
//		0 => [
//			'position' => 'junior',
//			'salary' => [
//				'fixed_part' => 50000,
//				'bonuses' => [
//					0 => 5000,
//					1 => 3000,
//					2 => 550,
//					3 => 450,
//				],
//			],
//		],
//		1 => [
//			'position' => 'middle',
//			'salary' => [
//				'fixed_part' => 70000,
//				'bonuses' => [
//					0 => 8000,
//					1 => 5000,
//					2 => 750,
//					3 => 1650,
//					4 => 1000,
//				],
//			],
//		],
//		2 => [
//			'position' => 'senior',
//			'salary' => [
//				'fixed_part' => 90000,
//				'bonuses' => [
//					0 => 10000,
//					1 => 1000,
//					2 => 500,
//					3 => 2000,
//					4 => 1500,
//					5 => 6000,
//				],
//			],
//		],
//	],
//];